In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
import pandas as pd
df = pd.read_excel('titanic3.xls')

In [3]:
df.sort_values("name", inplace = True) 
  
#dropping ALL duplicte values 
df.drop_duplicates(subset ="name", 
                     keep = False, inplace = True) 
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
600,3,0,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S,NaN,NaN,NaN
601,3,0,"Abbott, Master. Eugene Joseph",male,13.0,0,2,C.A. 2673,20.25,NaN,S,NaN,NaN,"East Providence, RI"
602,3,0,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S,NaN,190.0,"East Providence, RI"
603,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S,A,NaN,"East Providence, RI"
604,3,1,"Abelseth, Miss. Karen Marie",female,16.0,0,0,348125,7.65,NaN,S,16,NaN,"Norway Los Angeles, CA"

In [4]:
# dropping passed "columns 
df.drop(["sibsp", "parch","ticket", "cabin", "embarked", "boat", "body", "home.dest"], axis = 1, inplace = True)

In [5]:

df.head()

     pclass  survived                              name     sex   age   fare
600       3         0               Abbing, Mr. Anthony    male  42.0   7.55
601       3         0     Abbott, Master. Eugene Joseph    male  13.0  20.25
602       3         0       Abbott, Mr. Rossmore Edward    male  16.0  20.25
603       3         1  Abbott, Mrs. Stanton (Rosa Hunt)  female  35.0  20.25
604       3         1       Abelseth, Miss. Karen Marie  female  16.0   7.65

In [12]:
df_notsurvived = df[ df['survived'] == 0 ]

df = df.drop(df_notsurvived.index, axis=0)
df.head()

,pclass,survived,name,sex,age,fare
603,3,1,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,20.250
604,3,1,"Abelseth, Miss. Karen Marie",female,16.0,7.650
605,3,1,"Abelseth, Mr. Olaus Jorgensen",male,25.0,7.650
324,2,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,24.000
606,3,1,"Abrahamsson, Mr. Abraham August Johannes",male,20.0,7.925

In [27]:
#table = pd.pivot_table(df, values='name', index='sex', columns='survived', 'age', aggfunc='count')
#print(table)
#age = pd.cut(df['age'], [0, 18, 80])
#df.pivot_table('survived', ['sex', 'age'], 'pclass')

#df['fare'] = np.where()
df.pivot_table(index='sex', columns='pclass',
                    aggfunc={'survived':sum, 'fare':'mean'})

#1 class fare helped femals but not males.... per survival

              fare                       survived
pclass           1          2          3        1   2    3
sex
female  109.137500  23.759486  12.208572      139  94  105
male     72.697546  20.183000  13.977496       61  25   75